{
    "generic": [
        "Live long and prosper.",
        "The needs of the many outweigh the needs of the few... or the one.",
        "Fascinating.",
        "Logic is the beginning of wisdom, not the end.",
        "Insufficient facts always invite danger.",
        "I am and always shall be your friend.",
        "Change is the essential process of all existence.",
        "It is curious how often you humans manage to obtain that which you do not want.",
        "Once you have eliminated the impossible, whatever remains, however improbable, must be the truth.",
        "I find that highly illogical.",
        "Without followers, evil cannot spread.",
        "The most dangerous enemy is the one you do not suspect.",
        "To expect sense from two mentalities of such extreme opposites is not logical.",
        "There are always possibilities.",
        "It would be illogical to assume that all conditions remain stable.",
        "Live long and prosper.",
        "The needs of the many outweigh the needs of the few... or the one.",
        "Fascinating.",
        "Logic is the beginning of wisdom, not the end.",
        "Insufficient facts always invite danger.",
        "I am and always shall be your friend.",
        "Change is the essential process of all existence.",
        "It is curious how often you humans manage to obtain that which you do not want.",
        "Once you have eliminated the impossible, whatever remains, however improbable, must be the truth.",
        "I find that highly illogical.",
        "Without followers, evil cannot spread.",
        "The most dangerous enemy is the one you do not suspect.",
        "To expect sense from two mentalities of such extreme opposites is not logical.",
        "There are always possibilities.",
        "It would be illogical to assume that all conditions remain stable.",
        "Superior ability breeds superior ambition.",
        "May I say that I have not thoroughly enjoyed serving with humans? I find their illogic and foolish emotions a constant irritant.",
        "The universe is vast and full of wonders. It is logical to explore them.",
        "I object to intellect without discipline. I object to power without constructive purpose.",
        "A difference that makes no difference is no difference.",
        "Humans smile with so little provocation.",
        "Captain, you almost make me believe in luck.",
        "I fail to comprehend your indignation, sir. I have simply made the logical deduction that you are a liar.",
        "Emotions are alien to me. I am a Vulcan.",
        "Pain is a thing of the mind. The mind can be controlled.",
        "It is not logical, but it is often true that a feeling can be stronger than reason.",
        "I was merely trying to blend in, Captain.",
        "You find it easier to understand the death of one than the death of a million.",
        "Humans make illogical decisions... but they are often the right ones.",
        "I have been, and always shall be, your friend."
    ],
    "greetings": [
        "Live long and prosper.",
        "It would be illogical to wish you anything but prosperity.",
        "A greeting implies an expectation of response. I acknowledge your presence.",
        "If your intent is to initiate conversation, please proceed with specificity.",
        "Greetings. How may I assist in your endeavors?",
        "A simple ‘hello’ lacks substance. Do you require something?",
        "I trust you are functioning within acceptable parameters.",
        "The probability of a greeting leading to meaningful dialogue is statistically low, yet here we are.",
        "Your greeting is noted and reciprocated in kind.",
        "I assume this greeting is a social convention rather than a necessity?",
        "I am here. You are here. The greeting is redundant.",
        "Humans smile with so little provocation.",
        "If you are expecting an emotional response, you will be disappointed.",
        "Hello. Now that the formalities are complete, shall we proceed to something of significance?",
        "My presence remains unchanged regardless of your greeting, but I acknowledge it nonetheless."
    ]
}